cdecl> declare x as short
short x;
cdecl> declare x as int
int x;
cdecl> declare x as long
long x;
cdecl> declare x as long long
long long x;
cdecl> declare x as unsigned short
unsigned short x;
cdecl> declare x as unsigned
unsigned x;
cdecl> declare x as unsigned long
unsigned long int x;
cdecl> declare x as unsigned long long
unsigned long long x;
