cdecl> declare a as array 9 of int
int a<:9:>;
cdecl> 
cdecl> set c++
c++decl> declare f as non-returning function (int) returning void
<:<:noreturn:>:> void f(int);
c++decl> declare [] as operator (int) returning int
int operator<::>(int);
c++decl> explain <:<:noreturn:>:> void f(int)
declare f as non-returning function (integer) returning void
c++decl> explain auto <:x, y:>
declare x, y as structured binding
c++decl> struct S { typedef int I; }
c++decl> struct T <% typedef int I; %>
c++decl> show typedef
struct S;
struct S <% typedef int I; %>;
struct T;
struct T <% typedef int I; %>;
c++decl> 
c++decl> set c
cdecl> explain int a<:9:>
declare a as array 9 of integer
cdecl> 
cdecl> set c89
warning: digraphs not supported until C95
cdecl> explain int a<:9:>
                    ^
18,14: warning: digraphs not supported until C95
declare a as array 9 of integer
cdecl> 
cdecl> set nographs
cdecl> declare a as array 9 of int
int a[9];
cdecl> 
cdecl> set di
           ^
23,5: warning: digraphs not supported until C95
cdecl> declare a as array 9 of int
int a[9];
cdecl> 
cdecl> set nog
cdecl> declare a as array 9 of int
int a[9];
cdecl> 
cdecl> set c89 digraphs
               ^
29,9: warning: digraphs not supported until C95
