cdecl> #define t(x,y,z)  x ## y ## z
cdecl> 
cdecl> expand t(1,2,3)
t(1, 2, 3) => x ## y ## z
t(1, 2, 3) => 1 ## 2 ## 3
t(1, 2, 3) => 123
cdecl> expand t(,4,5)
t(, 4, 5) => x ## y ## z
t(, 4, 5) => ## 4 ## 5
t(, 4, 5) => 45
cdecl> expand t(6,,7)
t(6,, 7) => x ## y ## z
t(6,, 7) => 6 ## ## 7
t(6,, 7) => 67
cdecl> expand t(8,9,)
t(8, 9,) => x ## y ## z
t(8, 9,) => 8 ## 9 ##
t(8, 9,) => 89
cdecl> expand t(10,,)
t(10,,) => x ## y ## z
t(10,,) => 10 ## ##
t(10,,) => 10
cdecl> expand t(,11,)
t(, 11,) => x ## y ## z
t(, 11,) => ## 11 ##
t(, 11,) => 11
cdecl> expand t(,,12)
t(,, 12) => x ## y ## z
t(,, 12) => ## ## 12
t(,, 12) => 12
cdecl> expand t(,,)
t(,,) => x ## y ## z
t(,,) => ## ##
t(,,) =>
