cdecl> 
cdecl> set c
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C23
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set ck&r
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set k&r
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set k&rc
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set cknr
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set knr
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set knrc
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c78
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c89
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C89
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c90
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C89
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c95
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C95
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c99
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C99
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c11
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C11
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c17
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C17
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c18
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C17
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c23
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C23
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set c++
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++23
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set c++98
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++98
    prompt
    semicolon
  notrailing-return
    using                    (Not supported until C++11.)
    west-decl=bflo
c++decl> set c++03
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++03
    prompt
    semicolon
  notrailing-return
    using                    (Not supported until C++11.)
    west-decl=bflo
c++decl> set c++11
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++11
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set c++14
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++14
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set c++17
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++17
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set c++20
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++20
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set c++23
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++23
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> 
c++decl> set lang=c
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C23
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=ck&r
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=k&r
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=k&rc
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=cknr
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=knr
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=knrc
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c78
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=K&RC
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c89
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C89
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c90
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C89
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c95
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C95
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c99
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C99
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c11
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C11
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c17
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C17
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c18
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C17
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c23
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su         (Not supported in C.)
  noexplicit-int
  nographs
  noinfer-command
    lang=C23
    prompt
    semicolon
  notrailing-return
    using                    (Not supported in C.)
    west-decl=bflo
cdecl> set lang=c++
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++23
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set lang=c++98
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++98
    prompt
    semicolon
  notrailing-return
    using                    (Not supported until C++11.)
    west-decl=bflo
c++decl> set lang=c++03
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++03
    prompt
    semicolon
  notrailing-return
    using                    (Not supported until C++11.)
    west-decl=bflo
c++decl> set lang=c++11
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++11
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set lang=c++14
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++14
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set lang=c++17
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++17
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set lang=c++20
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++20
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
c++decl> set lang=c++23
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
    explicit-ecsu=su
  noexplicit-int
  nographs
  noinfer-command
    lang=C++23
    prompt
    semicolon
  notrailing-return
    using
    west-decl=bflo
