cdecl> struct S
cdecl> set c17
cdecl> declare a as array 9 of int
int a??(9??);
cdecl> explain int a??(9??)
declare a as array 9 of integer
cdecl> set c++
warning: trigraphs not supported since C++17
c++decl> declare f as non-returning function (int) returning void
[[noreturn]] void f(int);
c++decl> set c++11
c++decl> declare f as non-returning function (int) returning void
??(??(noreturn??)??) void f(int);
c++decl> declare ??'= as operator (int) returning reference to S
S& operator??'=(int);
c++decl> declare ??' as operator (reference to constant S, int) returning S
S operator??'(const S&, int);
c++decl> declare ??!??! as operator (reference to constant S, reference to constant S) returning bool
bool operator??!??!(const S&, const S&);
c++decl> declare ??! as operator (reference to constant S, reference to constant S) returning S
S operator??!(const S&, const S&);
c++decl> declare ??!= as operator (int) returning reference to S
S& operator??!=(int);
c++decl> declare ??- as operator returning S
S operator??-();
c++decl> set c++
warning: trigraphs not supported since C++17
c++decl> explain int a??(9??)
                      ^
14: warning: trigraphs not supported since C++17
declare a as array 9 of integer
c++decl> set c++03
c++decl> struct S ??< typedef int I; ??>
c++decl> show typedef
typedef struct S S;
struct S ??< typedef int I; ??>;
c++decl> set c++11
c++decl> explain ??(??(noreturn??)??) void f(int)
declare f as non-returning function (integer) returning void
c++decl> explain S& operator??'=(int)
declare ??'= as member operator (integer) returning reference to S
c++decl> explain S operator??'(const S&, int)
declare ??' as non-member operator (reference to constant S, integer) returning S
c++decl> explain bool operator??!??!(const S&, const S&)
declare ??!??! as non-member operator (reference to constant S, reference to constant S) returning boolean
c++decl> explain S operator??!(const S&, const S&)
declare ??! as non-member operator (reference to constant S, reference to constant S) returning S
c++decl> explain S& operator??!=(int)
declare ??!= as member operator (integer) returning reference to S
c++decl> explain S operator??-()
declare ??- as member operator returning S
c++decl> set nographs
c++decl> set knr
cdecl> set trigraphs
           ^
5: warning: trigraphs not supported until C89
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
  noexplain-by-default
    explicit-ecsu=su
  noexplicit-int
 trigraphs
    lang=K&RC
    prompt
    semicolon
    using
cdecl> declare a as array 9 of int
int a[9];
cdecl> set nographs
cdecl> set c23
cdecl> set trigraphs
           ^
5: warning: trigraphs not supported since C23
cdecl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
  noexplain-by-default
    explicit-ecsu=su
  noexplicit-int
 trigraphs
    lang=C23
    prompt
    semicolon
    using
cdecl> declare a as array 9 of int
int a[9];
cdecl> set nographs
cdecl> set c++
c++decl> set trigraphs
             ^
5: warning: trigraphs not supported since C++17
c++decl> set
  noalt-tokens
  nodebug
  noeast-const
    echo-commands
    english-types
  noexplain-by-default
    explicit-ecsu=su
  noexplicit-int
 trigraphs
    lang=C++23
    prompt
    semicolon
    using
c++decl> declare a as array 9 of int
int a[9];
c++decl> set nographs
